spec/fixtures/vcr_cassettes/stripe_cancel_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: description=yoshino%40malboro.info&plan=Free+Trial
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.4.2 p198 (2017-09-14)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33 PST
        2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 18 Oct 2017 05:52:19 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2902'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ZmY7A31Ejrt03b
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_BbNDK0GPJHwhl9",
          "object": "customer",
          "account_balance": 0,
          "created": 1508305938,
          "currency": "usd",
          "default_source": null,
          "delinquent": false,
          "description": "yoshino@malboro.info",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_BbNDRX6Xy8xTm5",
                "object": "subscription",
                "application_fee_percent": null,
                "billing": "charge_automatically",
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1508305938,
                "current_period_end": 1509515538,
                "current_period_start": 1508305938,
                "customer": "cus_BbNDK0GPJHwhl9",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1BEATWBgrAjRvl1ehR20aSPK",
                      "object": "subscription_item",
                      "created": 1508305939,
                      "metadata": {},
                      "plan": {
                        "id": "Free Trial",
                        "object": "plan",
                        "amount": 0,
                        "created": 1447767566,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Free Trial",
                        "statement_descriptor": null,
                        "trial_period_days": 14,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_BbNDRX6Xy8xTm5"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1508305938,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1509515538,
                "trial_start": 1508305938
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/subscriptions"
          },
          "cards": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/cards"
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Tue, 17 Oct 2017 15:00:00 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_BbNDK0GPJHwhl9
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.4.2 p198 (2017-09-14)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33 PST
        2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 18 Oct 2017 05:52:20 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2902'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_bTeLKAuZ4BOadD
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_BbNDK0GPJHwhl9",
          "object": "customer",
          "account_balance": 0,
          "created": 1508305938,
          "currency": "usd",
          "default_source": null,
          "delinquent": false,
          "description": "yoshino@malboro.info",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_BbNDRX6Xy8xTm5",
                "object": "subscription",
                "application_fee_percent": null,
                "billing": "charge_automatically",
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1508305938,
                "current_period_end": 1509515538,
                "current_period_start": 1508305938,
                "customer": "cus_BbNDK0GPJHwhl9",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_1BEATWBgrAjRvl1ehR20aSPK",
                      "object": "subscription_item",
                      "created": 1508305939,
                      "metadata": {},
                      "plan": {
                        "id": "Free Trial",
                        "object": "plan",
                        "amount": 0,
                        "created": 1447767566,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Free Trial",
                        "statement_descriptor": null,
                        "trial_period_days": 14,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_BbNDRX6Xy8xTm5"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1508305938,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1509515538,
                "trial_start": 1508305938
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/subscriptions"
          },
          "cards": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/cards"
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Tue, 17 Oct 2017 15:00:00 GMT
- request:
    method: delete
    uri: https://api.stripe.com/v1/subscriptions/sub_BbNDRX6Xy8xTm5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.4.2 p198 (2017-09-14)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33 PST
        2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 18 Oct 2017 05:52:20 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1691'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_H77kY06eaiSXoN
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_BbNDRX6Xy8xTm5",
          "object": "subscription",
          "application_fee_percent": null,
          "billing": "charge_automatically",
          "cancel_at_period_end": false,
          "canceled_at": 1508305940,
          "created": 1508305938,
          "current_period_end": 1509515538,
          "current_period_start": 1508305938,
          "customer": "cus_BbNDK0GPJHwhl9",
          "discount": null,
          "ended_at": 1508305940,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_1BEATWBgrAjRvl1ehR20aSPK",
                "object": "subscription_item",
                "created": 1508305939,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_BbNDRX6Xy8xTm5"
          },
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "Free Trial",
            "object": "plan",
            "amount": 0,
            "created": 1447767566,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Free Trial",
            "statement_descriptor": null,
            "trial_period_days": 14,
            "statement_description": null
          },
          "quantity": 1,
          "start": 1508305938,
          "status": "canceled",
          "tax_percent": null,
          "trial_end": 1509515538,
          "trial_start": 1508305938
        }
    http_version: 
  recorded_at: Tue, 17 Oct 2017 15:00:00 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_BbNDK0GPJHwhl9
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.4.2 p198 (2017-09-14)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.5.0 Darwin Kernel Version 16.5.0: Fri Mar  3 16:52:33 PST
        2017; root:xnu-3789.51.2~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 18 Oct 2017 05:52:21 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '816'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_f0KwZT26b8hCKh
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_BbNDK0GPJHwhl9",
          "object": "customer",
          "account_balance": 0,
          "created": 1508305938,
          "currency": "usd",
          "default_source": null,
          "delinquent": false,
          "description": "yoshino@malboro.info",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/subscriptions"
          },
          "cards": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BbNDK0GPJHwhl9/cards"
          },
          "default_card": null
        }
    http_version: 
  recorded_at: Tue, 17 Oct 2017 15:00:00 GMT
recorded_with: VCR 3.0.3
